app/controllers/editors_controller.rb

SELECT MAX("editors"."id") FROM "editors"
INSERT INTO "editors" ("filename", "hashpath", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["filename", "default"], ["hashpath", "4"], ["created_at", 2016-11-07 02:33:13 UTC], ["updated_at", 2016-11-07 02:33:13 UTC]]
---
  def create
    if Editor.maximum(:id).nil?
      next_id = 0
    else
      next_id = Editor.maximum(:id)+1;
    end

    @editor = Editor.new(params[:params])
    @editor.filename = "default"
    @editor.hashpath = next_id.to_s

    if @editor.save

SELECT `messages`.* FROM `messages`
---
  def show
  	@messages = Message.all

SELECT "messages".* FROM "messages" WHERE "messages"."editor_id" = ?  [["editor_id", 4]]
---
  def edit
    @editor_id = params[:id]
    gon.editor_id = @editor_id
    @id = params[:id]
    @messages = Message.where(editor_id: @id)