app/controllers/editors_controller.rb

SELECT "messages".* FROM "messages"
---
  def edit
  	@editor_id = params[:id]
    gon.editor_id = @editor_id
  	@messages = Message.all