app/controllers/welcome_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "editors".* FROM "editors" INNER JOIN "user_editor_relationships" ON "editors"."id" = "user_editor_relationships"."editor_id" WHERE "user_editor_relationships"."user_id" = ?  [["user_id", 1]]
---
  def index
    if current_user
      @user = current_user
    else
      redirect_to new_user_session_path, notice: 'You are not logged in.'
    end

    # if @user.username.nil?
    #   @username = Username.create(username: @user.email.partition("@").first)
    #   @user.username = @username
    # end
    if Username.where(user_id: @user.id).empty?
      @username = Username.create(username: @user.email.partition("@").first)
      @user.username = @username
    end

    @editors = @user.editors.all